---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsComponentJoinFailure
source: html/d6d81fc1-dbc3-3f22-a881-5b8def21a6e5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsComponentJoinFailure Property

Can't keep elements joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsComponentJoinFailure { get; }
```